Documents/Перемещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Перемещение</Name>
			<BasedOn>
				<xr:Item>Document.ПриходнаяНакладная</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТовара</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строк</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагНеПроверятьОстатки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Куда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Затраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>Затраты</Name>
			<Comment>Затраты на единицу номенклатуры партии</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма затрат на единицу товара (дельта цены)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>21</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВБазВалюте</Name>
					<Comment>Сумма затрат на единицу товара (дельта цены) в USD</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>21</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Зарегистрировано</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Затрата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Перемещение/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ДействияФормы
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИмяДокумента = Объект.Ссылка.Метаданные().Синоним;
	
	Если гоНПЗ(Параметры.ЗначениеКопирования) Тогда Сообщить(НСтр("ru = 'Копирование перемещений запрещено!'; en = 'Copying transfers is prohibited!'")); Отказ = Истина; Возврат; КонецЕсли; 
	
	РежимЗаписиПроведение = Новый Структура ("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	
	Избранный = гоИзбранный(Объект.Ссылка);
	
	ЧислоЗнаковКоличество = Объект.Фирма.ЧислоЗнаковКоличество;
	ЧислоЗнаковЦенаЗакупки = Объект.Фирма.ЧислоЗнаковЦенаЗакупки;
	
	Элементы.ТоварыКоличество.Формат = "ЧДЦ=" + ЧислоЗнаковКоличество;
	Элементы.ТоварыЦенаЗакупки.Формат = "ЧДЦ=" + ЧислоЗнаковЦенаЗакупки;
	Элементы.ТоварыНоменклатураРодитель.Видимость = Объект.Фирма.ВыводитьГруппа;
	Элементы.ТоварыНоменклатураПроизводитель.Видимость = Объект.Фирма.ВыводитьПроизводитель;
	Элементы.ТоварыСерия.Видимость = Объект.Фирма.ВыводитьСерия;
	Элементы.ТоварыПартияСрокГодности.Видимость = Объект.Фирма.ВыводитьСрокГодности;
	
	Элементы.ТоварыУдалитьВсе.Видимость = Истина;
	
	//Попытка
	//	Элементы.ФормаИзменитьФорму.Видимость = Ложь;
	//Исключение
	//КонецПопытки; 
	
	//2017.03.24
	Мас = ОбщегоНазначенияПовтИсп.МассивДоступныхСкладов();
	Если Мас.Количество() <> 0 Тогда
		Если (Мас.Найти(Объект.Склад) = Неопределено) И (Мас.Найти(Объект.Куда) = Неопределено) Тогда Отказ = Истина; Возврат; КонецЕсли; КонецЕсли;
		
	// © Primus1C  22.12.2023  НАЧАЛО ►
	Элементы.ГруппаСостояние.Видимость = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОтображатьСостояниеВФормеДокумента");
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента); 
	
	Элементы.Валюта.БыстрыйВыбор = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("БыстрыйВыборВалют"); 
	ЗаполнитьКэшДанных();

	Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) И НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Валюта 	= ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("Валюта");
		Объект.Склад 	= ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("Склад");
	КонецЕсли;	
	
	СтруктураПечатныхФорм = Документы.Перемещение.ПолучитьСтруктуруПечатныхФорм();  
	ПараметрыРазмещения = Новый Структура("Форма, ЭтоФормаОбъекта, КоманднаяПанель", ЭтаФорма, Истина, Неопределено);
	ОбщегоНазначенияСервер.ПодключитьКомандыПечати(ПараметрыРазмещения, СтруктураПечатныхФорм);   

	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)   
	
	клФормаДокументаПриОткрытии(ЭтаФорма, Объект);
	
	ТолПро = ЭтаФорма.ТолькоПросмотр;
	
	//2016.08.26
	//этоЧужой = Ложь;
	//Если НЕ Объект.Ссылка.Пустая() Тогда 
	//	этоЧужой = гоЧужойДокумент(Объект.КемСоздан);
	//КонецЕсли; 
	
	//2016.08.26 + ИЛИ этоЧужой
	Если Избранный 
		//ИЛИ этоЧужой 
		Тогда ТолПро = Истина КонецЕсли;
	
	ЭтаФорма.ТолькоПросмотр = ТолПро;
	
	стрПросмотр = клПросмотр(ЭтаФорма, Избранный, Объект.Ссылка);
	
	УстановитьВидимостьДоступность();
	МоиИтоги();
	
	РаботаСоСканеромШК.СканерШКПодключить();  
	
	// © Primus1C  27.12.2023  НАЧАЛО ►
	ОтобразитьЦветВалюты();
	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	клФормаДокументаПередЗаписью(Объект, Отказ);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)    

	// © Primus1C  06.07.2023  НАЧАЛО ►
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента);
	// © Primus1C  ОКОНЧАНИЕ ◄

	УстановитьВидимостьДоступность();
	//МоиОстатки();
	МоиИтоги();
КонецПроцедуры

#КонецОбласти


&НаКлиенте
Процедура МоиИтоги(НомерСтроки = Неопределено)
	
	// © Primus1C  02.12.2023  НАЧАЛО ►
	//стрИтого = "";
	//стрОплата = "";
	//омСервер.МоиИтоги(Объект, стрИтого, стрОплата); 
	СтруктураИтогов = омСервер.МоиИтогиФорматированные(Объект, Истина, Ложь);
	Элементы.ДекорацияИтого.Заголовок = Новый ФорматированнаяСтрока(ОбщегоНазначенияСервер.ТекстHTMLВФорматированнуюСтроку(СтруктураИтогов.Итоги));
	//стрОплата = СтруктураИтогов.Оплата;
	// © Primus1C  ОКОНЧАНИЕ ◄   
	
	// © Primus1C  05.11.2025  НАЧАЛО ►
	ОтобразитьЦеныСЗатратами(НомерСтроки);
	// © Primus1C  ОКОНЧАНИЕ ◄  
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьЦеныСЗатратами(НомерСтроки = Неопределено)
	
	//Соотв = Новый Соответствие;
	//Запр = Новый Запрос;
	//Запр.Текст = "ВЫБРАТЬ
	//             |	РаспрЗатрат.Номенклатура КАК Номенклатура,
	//             |	РаспрЗатрат.Количество КАК Количество,
	//             |	РаспрЗатрат.Цена КАК Цена,
	//             |	РаспрЗатрат.Сумма КАК Сумма,
	//             |	РаспрЗатрат.СуммаAWB КАК СуммаAWB,
	//             |	РаспрЗатрат.СуммаПеремещений КАК СуммаПеремещений
	//             |ИЗ
	//             |	Документ.ОтправкаПеремещений.РаспределениеЗатрат КАК РаспрЗатрат
	//             |ГДЕ
	//             |	РаспрЗатрат.Ссылка В
	//             |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//             |				ОтправкаПеремещенийПеремещения.Ссылка КАК Ссылка
	//             |			ИЗ
	//             |				Документ.ОтправкаПеремещений.Перемещения КАК ОтправкаПеремещенийПеремещения
	//             |			ГДЕ
	//             |				ОтправкаПеремещенийПеремещения.Перемещение.Проведен
	//             |				И ОтправкаПеремещенийПеремещения.Перемещение = &Ссылка)";
	//Запр.УстановитьПараметр("Ссылка", Объект.Ссылка);
	//Выборка = Запр.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	Соотв.Вставить(Выборка.Номенклатура, Выборка.Сумма / Выборка.Количество);
	//КонецЦикла;
	//Для каждого СтрокаТЧ Из Объект.Товары Цикл   
	//	Затр = Соотв.Получить(СтрокаТЧ.Номенклатура);
	//	Если Затр = Неопределено Тогда
	//		Затр = 0;	
	//	КонецЕсли;
	//	СтрокаТЧ.ЦенаСЗатратами = СтрокаТЧ.ЦенаЗакупки + Затр;
	//КонецЦикла;

	СоотвЗатрат = Новый Соответствие;
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	РНТовары.Партия КАК Партия,
	             |	ЗатратыПартий.Сумма КАК Сумма
	             |ИЗ
	             |	Документ.Перемещение.Товары КАК РНТовары
	             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	             |			Затраты.Партия КАК Партия,
	             |			СУММА(Затраты.Сумма) КАК Сумма
	             |		ИЗ
	             |			РегистрСведений.Затраты КАК Затраты
	             |		
	             |		СГРУППИРОВАТЬ ПО
	             |			Затраты.Партия) КАК ЗатратыПартий
	             |		ПО РНТовары.Партия = ЗатратыПартий.Партия
	             |ГДЕ
	             |	РНТовары.Ссылка = &Ссылка";
	Запр.УстановитьПараметр("Ссылка", Объект.Ссылка);  

	Если НомерСтроки = Неопределено Тогда
		
		Выборка = Запр.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СоотвЗатрат.Вставить(Выборка.Партия, Выборка.Сумма);		
		КонецЦикла;
		
		Для каждого СтрокаТЧ Из Объект.Товары Цикл   
			Затр = СоотвЗатрат.Получить(СтрокаТЧ.Номенклатура);
			Если Затр = Неопределено Тогда
				Затр = 0;	
			КонецЕсли;
			СтрокаТЧ.ЦенаСЗатратами = СтрокаТЧ.ЦенаЗакупки + Затр;
			СтрокаТЧ.СуммаСЗатратами = СтрокаТЧ.ЦенаСЗатратами * СтрокаТЧ.Количество;
		КонецЦикла; 
		
	Иначе
		
		Запр.Текст = "ВЫБРАТЬ
		             |	Затраты.Партия КАК Партия,
		             |	СУММА(Затраты.Сумма) КАК Сумма
		             |ИЗ
		             |	РегистрСведений.Затраты КАК Затраты
		             |ГДЕ
		             |	Затраты.Партия = &Партия
		             |
		             |СГРУППИРОВАТЬ ПО
		             |	Затраты.Партия";
		
		Попытка
		
		СтрокаТЧ = Объект.Товары[НомерСтроки];
		Запр.УстановитьПараметр("Партия", СтрокаТЧ.Партия);  
	
		Выборка = Запр.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаТЧ.ЦенаСЗатратами = СтрокаТЧ.ЦенаЗакупки + Выборка.Сумма;
			СтрокаТЧ.СуммаСЗатратами = СтрокаТЧ.ЦенаСЗатратами * СтрокаТЧ.Количество;
		КонецЦикла;
		
		Исключение
		КонецПопытки; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МоиОстатки()
	стрОстатки = "?";
	Стр = Элементы.Товары.ТекущиеДанные;
	Если Стр = Неопределено Тогда Возврат КонецЕсли; 
	стрОстатки = омСервер.МоиОстатки(Объект.Ссылка, Стр.Номенклатура, Стр.Партия) + гоРС() + омСервер.МоиОстатки(Объект.Ссылка, Стр.Номенклатура, Стр.Партия, Истина);
КонецПроцедуры

&НаКлиенте
Процедура МояЗаписать(ПроверятьМодифицированность = Истина)
	УстановитьВидимостьДоступность();
	
	Если ПроверятьМодифицированность Тогда
		Если НЕ Модифицированность Тогда Возврат КонецЕсли; КонецЕсли; 
		
	Записать(РежимЗаписиПроведение);
	//МоиОстатки();
	МоиИтоги();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	НетСтрок = Объект.Товары.Количество() = 0;
	ЕстьСтроки = НЕ НетСтрок;
	
	Закрыто = Объект.Окончательно;	
	НеЗакрыто = НЕ Закрыто;
	
	Элементы.Дата.ТолькоПросмотр = Закрыто;		//Объект.Проведен ИЛИ
	Элементы.Склад.ТолькоПросмотр = ЕстьСтроки ИЛИ Закрыто;
	Элементы.Куда.ТолькоПросмотр = Закрыто;
	Элементы.Валюта.ТолькоПросмотр = ЕстьСтроки ИЛИ Закрыто;
	Элементы.Установить.Доступность = НеЗакрыто;
	Элементы.Снять.Доступность = Закрыто;
КонецПроцедуры


#Область ДействияТабличнойЧасти
	
&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	МоиОстатки();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	МоеДобавление();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	МоеРедактирование(СтрЗаменить(Элемент.ТекущийЭлемент.Имя, "Товары", ""));
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
	МоеУдаление();
КонецПроцедуры

#КонецОбласти 


&НаКлиенте
Процедура МоеДобавление()
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли; 
	Если Объект.Окончательно Тогда Возврат КонецЕсли; 
	
	МоиИтоги();
	Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	Если гоПЗ(Объект.Склад) Тогда клОшибка(НСтр("ru = 'Не задан склад ОТКУДА!'; en = 'Warehouse not specified!'")); Возврат; КонецЕсли; 
	Если гоПЗ(Объект.Валюта) Тогда клОшибка(НСтр("ru = 'Не задана валюта!'; en = 'Currency not specified!'")); Возврат; КонецЕсли; 
	
	Если гоПЗ(Объект.Ссылка) Тогда МояЗаписать(Ложь) КонецЕсли; 
	
	Попытка
		НовНом = Элементы.Товары.ТекущиеДанные.Номенклатура;
		НовПар = Элементы.Товары.ТекущиеДанные.Партия;
	Исключение 
		НовНом = гоПустой("Номенклатура");
		НовПар = гоПустой("Партии");
	КонецПопытки;
	
	//КонстантаНеВыходить = 1;	//пока все без настроек
	//
	//НеВыходить = Истина;
	//Пока НеВыходить Цикл
	//	гоУстановитьПараметрСеанса("Склад", Объект.Склад);
	//	Если НЕ ВвестиЗначение(НовНом, НСтр("ru = 'Выберите номенклатуру'; en = 'Select the good'")) Тогда Возврат КонецЕсли; 
	//	
	//	гоУстановитьПараметрСеанса("Склад", Объект.Склад);
	//	гоУстановитьПараметрСеанса("Номенклатура", НовНом);
	//	
	//	//2015.12.20
	//	Если гоРеквизит(Объект.Фирма, "ПроверятьВалютуЗакупкиВПеремещении") Тогда  
	//		гоУстановитьПараметрСеанса("ВалютаВыбора", Объект.Валюта);
	//	КонецЕсли; 
	//	
	//	Если НЕ ВвестиЗначение(НовПар, НСтр("ru = 'Выберите партию'; en = 'Select batch'")) Тогда Продолжить КонецЕсли; 
	//	
	//	//тут работает выбор нормально, получим остаток партии, вдруг выбрали без остатка
	//	ОстПар = омСервер.ОстатокПартии(Объект.Фирма, Объект.Склад, НовПар);
	//	Если ОстПар <= 0 Тогда клОшибка(НСтр("ru = 'Нет остатка у выбранной партии!'; en = 'The selected batch has no balance!'")); Продолжить; КонецЕсли; 
	//	
	//	Нашли = Объект.Товары.НайтиСтроки(Новый Структура("Партия", НовПар));
	//	Если НЕ (Нашли.Количество() = 0) Тогда клОшибка(гоИмя(НовПар) + ": уже есть в документе!" + гоРС() + "Используйте редактирование количества!!!"); Продолжить; КонецЕсли;
	//	
	//	Пар = Новый Структура;
	//	Пар.Вставить("Фирма", Объект.Фирма);
	//	Пар.Вставить("Номенклатура", НовНом);
	//	Пар.Вставить("Количество", ОстПар);
	//	Пар.Вставить("Склад", Объект.Склад);
	//	Пар.Вставить("Партия", НовПар);
	//	
	//	Пар = ОткрытьФормуМодально("ОбщаяФорма.ВводСтрокиПМ", Пар);
	//	Если гоПЗ(Пар) Тогда Продолжить КонецЕсли; 
	//	
	//	НовКол = Пар.Количество;
	//	Если НовКол = 0 Тогда клОшибка(НСтр("ru = 'Не введено количество!'; en = 'Quantity is not specified!'")); Продолжить; КонецЕсли;
	//	
	//	Если НЕ клСохранитьИзменения() Тогда Продолжить КонецЕсли;
	//	
	//	ОстПар = омСервер.ОстатокПартии(Объект.Фирма, Объект.Склад, НовПар);
	//	Если НовКол > ОстПар Тогда 
	//		клОшибка("Не хватило остатка " + Строка(НовКол - ОстПар) + " для " + гоИмя(НовПар) + ", исправлено на " + ОстПар + "!");
	//		НовКол = ОстПар;
	//	КонецЕсли;
	//	
	//	НовСтр = Объект.Товары.Добавить();
	//	
	//	НовСтр.Номенклатура = НовНом;
	//	НовСтр.Партия = НовПар;
	//	НовСтр.Количество = НовКол;
	//	
	//	ИДИ = НовСтр.ПолучитьИдентификатор();
	//	
	//	МояЗаписать(Ложь);
	//	
	//	гоЗаписьЖурналаРегистрации(Строка(НовКол) + "|" + гоИмя(НовНом, Ложь), ИмяДокумента + ?(Объект.Окончательно, "ПослеОкончательно", ""), "Добавление строки", Объект.Ссылка, 2);
	//	
	//	Элементы.Товары.ТекущаяСтрока = ИДИ;
	//	
	//	НеВыходить = КонстантаНеВыходить;
	//КонецЦикла; 
	МоеДобавлениеШаг(НовНом, НовПар);

КонецПроцедуры

&НаКлиенте
Процедура МоеДобавлениеШаг(НовНом, НовПар)
	гоУстановитьПараметрСеанса("Склад", Объект.Склад);
	ПоказатьВводЗначения(Новый ОписаниеОповещения("МоеДобавлениеПослеВыбораНоменклатуры", ЭтотОбъект, НовПар), НовНом, НСтр("ru = 'Выберите номенклатуру'; en = 'Select the good'"));
КонецПроцедуры

&НаКлиенте
Процедура МоеДобавлениеПослеВыбораНоменклатуры(НовНом, НовПар) Экспорт
	Если НовНом = Неопределено Тогда Возврат КонецЕсли; 
	
	гоУстановитьПараметрСеанса("Склад", Объект.Склад);
	гоУстановитьПараметрСеанса("Номенклатура", НовНом);
	
	//2015.12.20
	Если гоРеквизит(Объект.Фирма, "ПроверятьВалютуЗакупкиВПеремещении") Тогда  
		гоУстановитьПараметрСеанса("ВалютаВыбора", Объект.Валюта);
	КонецЕсли; 
	
	ПоказатьВводЗначения(Новый ОписаниеОповещения("МоеДобавлениеПослеВыбораПартии", ЭтотОбъект, НовНом), НовПар, НСтр("ru = 'Выберите партию'; en = 'Select batch'"));
КонецПроцедуры

&НаКлиенте
Процедура МоеДобавлениеПослеВыбораПартии(НовПар, НовНом) Экспорт
	Если НовПар = Неопределено Тогда 
		МоеДобавлениеШаг(НовНом, НовПар); 
		Возврат; 
	КонецЕсли; 
	
	//тут работает выбор нормально, получим остаток партии, вдруг выбрали без остатка
	ОстПар = омСервер.ОстатокПартии(Объект.Фирма, Объект.Склад, НовПар);
	Если ОстПар <= 0 Тогда 
		клОшибка(НСтр("ru = 'Нет остатка у выбранной партии!'; en = 'The selected batch has no balance!'")); 
		МоеДобавлениеШаг(НовНом, НовПар); 
		Возврат; 
	КонецЕсли; 
	
	Нашли = Объект.Товары.НайтиСтроки(Новый Структура("Партия", НовПар));
	Если НЕ (Нашли.Количество() = 0) Тогда 
		клОшибка(гоИмя(НовПар) + ": уже есть в документе!" + гоРС() + "Используйте редактирование количества!!!"); 
		МоеДобавлениеШаг(НовНом, НовПар); 
		Возврат; 
	КонецЕсли;
	
	Пар = Новый Структура;
	Пар.Вставить("Фирма", Объект.Фирма);
	Пар.Вставить("Номенклатура", НовНом);
	Пар.Вставить("Количество", ОстПар);
	Пар.Вставить("Склад", Объект.Склад);
	Пар.Вставить("Партия", НовПар);
	
	ОткрытьФорму("ОбщаяФорма.ВводСтрокиПМ", Пар, ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("МоеДобавлениеПослеВводаСтроки", ЭтотОбъект, Новый Структура("НовНом,НовПар", НовНом, НовПар)));
КонецПроцедуры

&НаКлиенте
Процедура МоеДобавлениеПослеВводаСтроки(Пар, Параметры) Экспорт
	НовНом = Параметры.НовНом;
	НовПар = Параметры.НовПар;
	
	Если гоПЗ(Пар) Тогда 
		МоеДобавлениеШаг(НовНом, НовПар); 
		Возврат; 
	КонецЕсли; 
	
	НовКол = Пар.Количество;
	Если НовКол = 0 Тогда 
		клОшибка(НСтр("ru = 'Не введено количество!'; en = 'Quantity is not specified!'")); 
		МоеДобавлениеШаг(НовНом, НовПар); 
		Возврат; 
	КонецЕсли;
	
	клСохранитьИзменения(Новый ОписаниеОповещения("МоеДобавлениеПослеПодтверждения", ЭтотОбъект, Новый Структура("НовНом,НовПар,НовКол", НовНом, НовПар, НовКол)));
КонецПроцедуры

&НаКлиенте
Процедура МоеДобавлениеПослеПодтверждения(Результат, Параметры) Экспорт
	НовНом = Параметры.НовНом;
	НовПар = Параметры.НовПар;
	
	Если НЕ Результат Тогда 
		МоеДобавлениеШаг(НовНом, НовПар); 
		Возврат; 
	КонецЕсли; 
	
	НовКол = Параметры.НовКол;
	
	ОстПар = омСервер.ОстатокПартии(Объект.Фирма, Объект.Склад, НовПар);
	Если НовКол > ОстПар Тогда 
		клОшибка("Не хватило остатка " + Строка(НовКол - ОстПар) + " для " + гоИмя(НовПар) + ", исправлено на " + ОстПар + "!");
		НовКол = ОстПар;
	КонецЕсли;
	
	НовСтр = Объект.Товары.Добавить();
	
	НовСтр.Номенклатура = НовНом;
	НовСтр.Партия = НовПар;
	НовСтр.Количество = НовКол;
	
	ИДИ = НовСтр.ПолучитьИдентификатор();
	
	МояЗаписать(Ложь);
	
	гоЗаписьЖурналаРегистрации(Строка(НовКол) + "|" + гоИмя(НовНом, Ложь), ИмяДокумента + ?(Объект.Окончательно, "ПослеОкончательно", ""), "Добавление строки", Объект.Ссылка, 2);
	
	Элементы.Товары.ТекущаяСтрока = ИДИ;
	
	МоеДобавлениеШаг(НовНом, НовПар);
КонецПроцедуры



&НаКлиенте
Процедура ЛюбаяСерия(ШК, СтатьНаРучной = Ложь)
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли; 
	Если Объект.Окончательно Тогда Возврат КонецЕсли; 
	
	МоиИтоги(Объект.Товары.Количество()-1);
	Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	Если гоПЗ(Объект.Склад) Тогда клОшибка("Не задан склад ОТКУДА!"); Возврат; КонецЕсли; 
	Если гоПЗ(Объект.Валюта) Тогда клОшибка("Не задана валюта!"); Возврат; КонецЕсли; 
	
	Если гоПЗ(Объект.Ссылка) Тогда МояЗаписать(Ложь) КонецЕсли; 
	
	//по идее, нужно найти товар с такой серией и передать его в добавление строки, зачем изобретать велосипед?
	СпиПар = омСервер.ПартииПоСерииОстатки(ШК, Объект.Фирма, Объект.Склад);
	
	Ско = СпиПар.Количество();
	ТекПар = 0;
	Если Ско  = 0 Тогда
		Сигнал();
		клОшибка("Нет остатков по серии: " + ШК + "!");
		Возврат;
	ИначеЕсли Ско > 1 Тогда
		Сигнал();
		Эле = СпиПар.ВыбратьЭлемент("Найдено несколько партий с такой серией, выберите:");
		Если Эле = Неопределено Тогда Возврат КонецЕсли;
		ТекПар = Эле.Значение;
	Иначе
		ТекПар = СпиПар[0].Значение;
	КонецЕсли; 
	Если ТекПар = 0 Тогда Возврат КонецЕсли; 
	
	//2015.12.25
	Если гоРеквизит(Объект.Фирма, "ПроверятьВалютуЗакупкиВПеремещении") Тогда  
		НовВал = гоРеквизит(ТекПар, "Валюта");
		Если НовВал <> Объект.Валюта Тогда клОшибка("Не та валюта: " + гоИмя(НовВал) + "!"); Возврат; КонецЕсли;
	КонецЕсли; 
	
	НовКол = 1;
	НовНом = гоРеквизит(ТекПар, "Владелец");
	
	НовСтр = Объект.Товары.Добавить();
	
	НовСтр.Номенклатура = НовНом;
	НовСтр.Партия = ТекПар;
	НовСтр.Количество = НовКол;
	
	ИДИ = НовСтр.ПолучитьИдентификатор();
	
	МояЗаписать(Ложь);
	
	гоЗаписьЖурналаРегистрации(ШК + "|" + Строка(НовКол) + "|" + гоИмя(НовНом, Ложь), ИмяДокумента + ?(Объект.Окончательно, "ПослеОкончательно", ""), "Добавление строки", Объект.Ссылка, 2);
	
	Элементы.Товары.ТекущаяСтрока = ИДИ;
	
	Если СтатьНаРучной Тогда 
		РучнойШК = "";
		ПодключитьОбработчикОжидания("МоеОжидание", 0.1, Истина);
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура МоеРедактирование(Кол)     
	
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли; 
	Если Объект.Окончательно Тогда Возврат КонецЕсли; 
	
	МоиИтоги();
	Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	Стр = Элементы.Товары.ТекущиеДанные;
	Если Стр = Неопределено Тогда Возврат КонецЕсли; 
	
	ИДИ = Элементы.Товары.ТекущаяСтрока;
	
	Если Кол = "Количество" Тогда
		БылКол = Стр.Количество;
		НовКол = БылКол;
		
		//Если НЕ ВвестиЧисло(НовКол, "Введите количество", 14, ЧислоЗнаковКоличество) Тогда Возврат КонецЕсли; 
		//
		//ОстПар = омСервер.ОстатокПартии(Объект.Фирма, Объект.Склад, Стр.Партия);
		//Если Объект.Проведен Тогда ОстПар = ОстПар + БылКол КонецЕсли;
		//
		//Если НовКол > ОстПар Тогда 
		//	клОшибка("Не хватило остатка " + Строка(НовКол - ОстПар) + " для " + гоИмя(Стр.Партия) + ", исправлено на " + ОстПар + "!");
		//	НовКол = ОстПар;
		//КонецЕсли;
		//Если НовКол = Стр.Количество Тогда Возврат КонецЕсли;
		//
		//Стр.Количество = НовКол;
		//
		//МояЗаписать(Ложь);
		//
		//Колич = НовКол;
		//Номен = Стр.Номенклатура;
		//
		//гоЗаписьЖурналаРегистрации(Строка(БылКол) + "->" + Строка(Колич) + "|" + гоИмя(Объект.Ссылка, Ложь), ИмяДокумента, "Редактирование количества", Номен, 2);
		//гоЗаписьЖурналаРегистрации(Строка(БылКол) + "->" + Строка(Колич) + "|" + гоИмя(Номен, Ложь), ИмяДокумента, "Редактирование количества", Объект.Ссылка, 2);
		//Возврат;
		ПоказатьВводЧисла(Новый ОписаниеОповещения("МоеРедактированиеПослеВводаКоличества", ЭтотОбъект, Новый Структура("ИДИ,БылКол", ИДИ, БылКол)), НовКол, "Введите количество", 14, ЧислоЗнаковКоличество);
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры
 
&НаКлиенте
Процедура МоеРедактированиеПослеВводаКоличества(НовКол, Параметры) Экспорт
	Если НовКол = Неопределено Тогда Возврат КонецЕсли;
	
	ИДИ = Параметры.ИДИ;
	БылКол = Параметры.БылКол;
	Стр = Объект.Товары.НайтиПоИдентификатору(ИДИ);
	Если Стр = Неопределено Тогда Возврат КонецЕсли; 
	
	ОстПар = омСервер.ОстатокПартии(Объект.Фирма, Объект.Склад, Стр.Партия);
	Если Объект.Проведен Тогда ОстПар = ОстПар + БылКол КонецЕсли;
	
	Если НовКол > ОстПар Тогда 
		клОшибка("Не хватило остатка " + Строка(НовКол - ОстПар) + " для " + гоИмя(Стр.Партия) + ", исправлено на " + ОстПар + "!");
		НовКол = ОстПар;
	КонецЕсли;
	Если НовКол = Стр.Количество Тогда Возврат КонецЕсли;
	
	Стр.Количество = НовКол;
	
	МояЗаписать(Ложь);
	
	Колич = НовКол;
	Номен = Стр.Номенклатура;
	
	гоЗаписьЖурналаРегистрации(Строка(БылКол) + "->" + Строка(Колич) + "|" + гоИмя(Объект.Ссылка, Ложь), ИмяДокумента, "Редактирование количества", Номен, 2);
	гоЗаписьЖурналаРегистрации(Строка(БылКол) + "->" + Строка(Колич) + "|" + гоИмя(Номен, Ложь), ИмяДокумента, "Редактирование количества", Объект.Ссылка, 2);
КонецПроцедуры


&НаКлиенте
Процедура МоеУдаление()
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	Если Объект.Окончательно Тогда 
		Если гоАдминистратор() Тогда 
			Сообщить("Под ответственность Администратора!");
		Иначе 
			Возврат;
		КонецЕсли; 
	КонецЕсли; 
	
	МоиИтоги();
	Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	ИДИ = Элементы.Товары.ТекущаяСтрока;
	Стр = Элементы.Товары.ТекущиеДанные;
	Если Стр = Неопределено Тогда Возврат КонецЕсли; 
	
	//Если клНетДа(НСтр("ru = 'Удалить строку?'; en = 'Delete the line?'")) Тогда Возврат КонецЕсли; 
	//
	//Номен = Стр.Номенклатура;
	//Колич = Стр.Количество;
	//
	//Удаляем = Объект.Товары.НайтиПоИдентификатору(ИДИ);
	//Если Удаляем = Неопределено Тогда клОшибка("Странно, не нашли текущую строку!"); Возврат; КонецЕсли; 
	//
	//Объект.Товары.Удалить(Удаляем);
	//
	//гоЗаписьЖурналаРегистрации(Строка(Колич) + "|" + гоИмя(Номен, Ложь), ИмяДокумента + ?(Объект.Окончательно, "ПослеОкончательно", ""), "Удаление строки", Объект.Ссылка, 2);
	//
	//МояЗаписать(Ложь);
	клНетДа(Новый ОписаниеОповещения("МоеУдалениеЗавершение", ЭтотОбъект, ИДИ),
		НСтр("ru = 'Удалить строку?'; en = 'Delete the line?'"));

КонецПроцедуры
  
&НаКлиенте
Процедура МоеУдалениеЗавершение(Результат, ИДИ) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Удаляем = Объект.Товары.НайтиПоИдентификатору(ИДИ);
	Если Удаляем = Неопределено Тогда клОшибка("Странно, не нашли текущую строку!"); Возврат; КонецЕсли; 
	
	Номен = Удаляем.Номенклатура;
	Колич = Удаляем.Количество;
	
	Объект.Товары.Удалить(Удаляем);
	
	гоЗаписьЖурналаРегистрации(Строка(Колич) + "|" + гоИмя(Номен, Ложь), ИмяДокумента + ?(Объект.Окончательно, "ПослеОкончательно", ""), "Удаление строки", Объект.Ссылка, 2);
	
	МояЗаписать(Ложь);
КонецПроцедуры


&НаКлиенте
Процедура Установить(Команда)
	Если Объект.Окончательно Тогда Возврат КонецЕсли;
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	Если Объект.Товары.Количество() = 0 Тогда 
		клНамекнуть(ИмяДокумента, НСтр("ru = 'Документ пуст!'; en = 'The document is empty!'"), БиблиотекаКартинок.ПоискДанных);
		Возврат;
	КонецЕсли;
	
	Если гоПЗ(Объект.Куда) Тогда клОшибка(НСтр("ru = 'Не задан склад КУДА!'; en = 'Destination not specified!'")); Возврат; КонецЕсли; 
	Если Объект.Куда = Объект.Склад Тогда клОшибка("А смысл?!"); Возврат; КонецЕсли;
	
	клНетДа(Новый ОписаниеОповещения("УстановитьПослеПодтверждения", ЭтотОбъект), НСтр("ru = 'Установить флаг <Окончательно>?'; en = 'Set flag <Finaly>?'"));
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПослеПодтверждения(Результат, ДопПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Объект.Окончательно = Истина;
	МояЗаписать(Ложь);
	
	гоЗаписьЖурналаРегистрации("Установили", ИмяДокумента, "Установка {Окончательно}", Объект.Ссылка, 2);
КонецПроцедуры

&НаКлиенте
Процедура Снять(Команда)
	Если НЕ Объект.Окончательно Тогда Возврат КонецЕсли; 
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	
	МоиИтоги();
	Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	Сч = 0;
	Для Каждого Стр Из Объект.Товары Цикл
		Если гоПЗ(Стр.Номенклатура) ИЛИ гоПЗ(Стр.Партия) ИЛИ (Стр.Количество = 0) Тогда Продолжить КонецЕсли;
		
		Ост = омСервер.ОстатокПартии(Объект.Фирма, Объект.Куда, Стр.Партия);
		Если Ост >= Стр.Количество Тогда Продолжить КонецЕсли;
		
		//Сообщить("На складе КУДА будет отрицательный остаток (" + Строка(Ост - Стр.Количество) + ") для " + гоИмя(Стр.Партия)); 
		Сообщить(СтрШаблон(НСтр("ru = 'На складе КУДА будет отрицательный остаток (%1) для %2'; en = 'There will be a negative balance of %2 in the warehouse (%!) '"), Строка(Ост - Стр.Количество), гоИмя(Стр.Партия)));
		гоПлюс(Сч);
	КонецЦикла;
	
	Если Сч <> 0 Тогда клОшибка(СтрШаблон(НСтр("ru = 'Остатки станут отрицательными %1!'; en = 'The balances will become negative %1!'"), гоИмя(Сч))); Возврат; КонецЕсли;
	
	клНетДа(Новый ОписаниеОповещения("СнятьПослеПодтверждения", ЭтотОбъект), НСтр("ru = 'Снять флаг {Окончательно}?'; en = 'Unset flag <Finaly>?'"));
КонецПроцедуры

&НаКлиенте
Процедура СнятьПослеПодтверждения(Результат, ДопПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Объект.Окончательно = Ложь;
	МояЗаписать(Ложь);
	
	гоЗаписьЖурналаРегистрации("Сняли", ИмяДокумента, "Снятие {Окончательно}", Объект.Ссылка, 2);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсе(Команда)
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	Если Объект.Окончательно Тогда Возврат КонецЕсли; 
	
	МоиИтоги();
	Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	клНетДа(Новый ОписаниеОповещения("УдалитьВсеЗавершение", ЭтотОбъект), НСтр("ru = 'Удалить все строки?'; en = 'Delete all lines?'"));
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсеЗавершение(Результат, ДопПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Объект.Товары.Очистить();
	
	МояЗаписать(Ложь);
КонецПроцедуры


&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	//2016.02.08
	Если НЕ (ЭтаФорма.Окно = АктивноеОкно()) Тогда Возврат КонецЕсли; 
	
	ШК = "";
	Если РаботаСоСканеромШК.СканерШКНачатьОбработку(Источник, Событие, Данные, ШК) Тогда  
		ЛюбаяСерия(ШК);
		РаботаСоСканеромШК.СканерШКЗавершитьОбработку();
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура РучнойШКПриИзменении(Элемент)
	
	ЛюбаяСерия(РучнойШК, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура МоеОжидание()
	
	ЭтаФорма.ТекущийЭлемент = Элементы.РучнойШК;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзБуфераОбмена(Команда)

	//придется все продублировать
	Если ЭтаФорма.ТолькоПросмотр ИЛИ Объект.Окончательно Тогда
		Возврат;
	КонецЕсли;
	
	МоиИтоги();
	Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	Если гоПЗ(Объект.Склад) Тогда клОшибка(НСтр("ru = 'Не задан склад!'; en = 'Store not specified!'")); Возврат; КонецЕсли; 
	Если гоПЗ(Объект.Валюта) Тогда клОшибка(НСтр("ru = 'Не задана валюта!'; en = 'Currency not specified!'")); Возврат; КонецЕсли; 
	
	Если гоПЗ(Объект.Ссылка) Тогда МояЗаписать(Ложь) КонецЕсли; 
	
	Буф = РаботаСоСканеромШК.ПолучитьИМЕИИзБуфера_Стар();
	
	//2016.04.23
	//если уже есть такой товар, зачем искать цену
	ЕстЦен = 0;
	Если Объект.Товары.Количество() <> 0 Тогда
		Мас = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", НовНом));
		Если Мас.Количество() <> 0 Тогда ЕстЦен = Мас[0].ЦенаПродажи КонецЕсли;
	КонецЕсли; 
	
	////2016.04.23
	//Если ЕстЦен <> 0 Тогда 
	//	НовЦен = ЕстЦен;
	//Иначе 
	//	НовЦен = 0;
	//	Если НЕ ВвестиЧисло(НовЦен, "Цена (0 - взять цены прихода)", 19, ЧислоЗнаковЦена) Тогда Возврат КонецЕсли;
	//КонецЕсли;
	
	НСтр = СтрЧислоСтрок(Буф);
	
	//тут должна быть одна колонка, после получения первого непустого значения (могут быть табуляции) - больше не ищем
	Для Н = 1 По НСтр Цикл
		СС = "";
		С = СтрПолучитьСтроку(Буф, Н);
		Пока (СС = "") И (С <> "") Цикл
			СС = гоСледПолеТаб(С);
		КонецЦикла; 
		ЛюбаяСерия(СС);
	КонецЦикла;  
	
КонецПроцедуры

// © Primus1C  27.12.2023  НАЧАЛО ►

 &НаСервере
Процедура ЗаполнитьКэшДанных()
	 
	 КэшДанных = Новый Структура;
	 КэшДанных.Вставить("РаскрашиватьВалюты", ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("РаскрашиватьВалюты"));
	 КэшДанных.Вставить("ЦветаВалют", ОбщегоНазначенияПовтИсп.ЦветаВалют());
	 
КонецПроцедуры    
 
 &НаКлиенте
Процедура ОтобразитьЦветВалюты() 
	
	Если КэшДанных.РаскрашиватьВалюты Тогда
		Элементы.Валюта.ЦветФона = КэшДанных.ЦветаВалют.Получить(Объект.Валюта);
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	ОтобразитьЦветВалюты();

КонецПроцедуры


#Область ПодключаемаяПечать
	
&НаКлиенте
Процедура ВыполнитьПодключеннуюПечать(Команда)
	
	ВариантПечатнойФормы = СтрЗаменить(Команда.Имя, "ПодключеннаяПечать_", "");   
	ТабДок = ПечатнаяФорма(ВариантПечатнойФормы);
	ПараметрыПечати = Новый Структура("Таб, Имя, НеДляПечати", ТабДок, гоИмя(Объект.Ссылка, Ложь), Ложь);
	ОткрытьФорму("ОбщаяФорма.ПечатьБезЗащиты", ПараметрыПечати, , Истина); 
		
КонецПроцедуры  

&НаСервере
Функция ПечатнаяФорма(ВариантПечатнойФормы)

	ТабДок = Новый ТабличныйДокумент;
	Документы.Перемещение.ПечатьДокумента(Объект.Ссылка, ВариантПечатнойФормы, ТабДок);
	Возврат ТабДок;
	
КонецФункции 

#КонецОбласти  

// © Primus1C  ОКОНЧАНИЕ ◄
